---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfigurationInfo.GetAllFabricationConfigurations
source: html/3450b8a8-63ac-543c-1813-1b30b0987a1d.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.GetAllFabricationConfigurations Method

Gets all added fabrication configurations.

## Syntax (C#)
```csharp
public static IList<FabricationConfigurationInfo> GetAllFabricationConfigurations()
```

## Returns
All added fabrication configurations.